src_doc/InformationRegisters/ДокументыЭДОКСозданиюВДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыЭДОКСозданиюВДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоматическоеСоздание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументЭДО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ДокументыЭДОКСозданиюВДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьПопыткуАвтоматическогоСоздания(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
	Запись.Записать();
	
	Возврат Запись.КоличествоПопытокОбработки;
	
КонецФункции

Процедура СнятьДокументСАвтоматическогоСоздания(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Запись.АвтоматическоеСоздание = Ложь;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет входящий документ ЭДО из списка к отражению в документах ДО
// 
// Параметры:
//  ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документ ЭДО, который необходимо убрать из списка
Процедура УдалитьДокументИзСпискаКОтражению(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	
	Запись.Удалить();
	
КонецПроцедуры

Функция ДокументЭДОТребуетОтраженияВДО(ДокументЭДО) Экспорт
	
	Запись = РегистрыСведений.ДокументыЭДОКСозданиюВДО.СоздатьМенеджерЗаписи();
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
